Sorensen/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel    Newtonian;

nu    [0 2 -1 0 0 0 0]    3.5e-06;

H    [0 1 0 0 0 0 0]    0.00417;

KRS   [0 1 -1 0 0 0 0]    0.000037;

KAS    [0 1 -1 0 0 0 0]    0.000046;

KAA    [0 1 -1 0 0 0 0]    0.000046;

TACT    [0 0 1 0 0 0 0]    1.0;

theta    [0 0 0 0 0 0 0]    0.0;


D_RP    [0 2 -1 0 0 0 0]    1.58e-13;

D_AP    [0 2 -1 0 0 0 0]    1.58e-13;

D_APR    [0 2 -1 0 0 0 0]    2.57e-10;

D_APS    [0 2 -1 0 0 0 0]    2.14e-10;

D_PT    [0 2 -1 0 0 0 0]    3.32e-11;

D_TRB    [0 2 -1 0 0 0 0]    4.16e-11;

D_ATIII    [0 2 -1 0 0 0 0]    3.49e-11;

k1_T    [0 0 -1 0 0 0 0]    13.333;

KAT    [0 -3 0 0 1 0 0]    0.0001;

KT    [0 -3 0 0 1 0 0]    3.50e-05;

alpha    [0 0 0 0 0 0 0]    1.0;

//**Here, the enzyme unit is treated as dimensionless.
beta    [0 0 0 0 1 0 0]    9.11e-12;

phi_at    [0 3 -1 0 -2 0 0]    3.69e-03;

phi_rt    [0 3 -1 0 -2 0 0]    6.50e-04;

lambda_j    [0 0 0 0 1 0 0]    2.4e-17;

spj    [0 0 -1 0 1 0 0]    9.5e-21;



tau_low_wall    [1 -1 -2 0 0 0 0]    2.0e-02;

tau_high_wall    [1 -1 -2 0 0 0 0]    1.5e-01;

tau_bd_wall    [1 -1 -2 0 0 0 0]    8.0e-01;

tau_low_thr    [1 -1 -2 0 0 0 0]    1.0e-01;

tau_high_thr    [1 -1 -2 0 0 0 0]    3.0e-01;

tau_bd_thr    [1 -1 -2 0 0 0 0]    9.0e-01;



eps_t    [0 -3 0 0 0 0 0]    5.25e18;

phi_ai    [0 -3 0 0 0 0 0]    25.0e12;

phi_ni    [0 -3 0 0 0 0 0]    475.0e12;

rho    [1 -3 0 0 0 0 0]    1.06e03;

// ************************************************************************* //
